       FD  PAYMENT-TRANSACTION-FILE
           LABEL RECORDS ARE STANDARD
           BLOCK CONTAINS 0 RECORDS
           RECORD CONTAINS 24 CHARACTERS
           DATA RECORD IS PAYMENT-TRANSACTION-RECORD.

       01  PAYMENT-TRANSACTION-RECORD.
           05  PT-PARENT-ID        PIC 9(8).
           05  PT-PAYMENT-DATE     PIC 9(8).   *> YYYYMMDD
           05  PT-PAYMENT-AMOUNT   PIC 9(6)V99.
